{
    "When were the UAE united?": [
        {
            "text": "[1] History [ edit ] See also: List of cabinets of the United Arab Emirates The first cabinet was formed following the union of UAE as a federation on 9 December 1971. [2] [3] The last reshuffle was on 6 January 2024. [4] Jurisdiction [ edit ] [5] The main jurisdiction of the cabinet lies with standardising laws and coordination between the various emirates, in addition to exclusive jurisdiction over defence and foreign affairs, among others. [1] Members of the Cabinet [ edit ]",
            "url": "https://en.wikipedia.org/wiki/Cabinet_of_the_United_Arab_Emirates",
            "sents_per_passage": 5,
            "retrieval_score": 3.4946227073669434
        },
        {
            "text": "Abu Dhabi Dubai Ras Al Khaimah Common law courts ADGM DIFC Elections Parliamentary Elections 2006 2011 2015 2019 2023 Local governments Abu Dhabi Dubai Sharjah Ajman Umm Al Quwain Ras Al Khaimah Fujairah Rulers Royal families Foreign relations Ministry of Foreign Affairs Minister : Abdullah bin Zayed Al Nahyan Diplomatic missions of / in the UAE Nationality law Passport Visa requirements Visa policy Expatriates in the UAE Related topics Flag Emblem Anthem Military Political history United Arab Emirates portal v t e The Cabinet of the United Arab Emirates , or Council of Ministers ( Arabic : مجلس الوزراء ), is the chief executive body of the United Arab Emirates (UAE) federal government .",
            "url": "https://en.wikipedia.org/wiki/Cabinet_of_the_United_Arab_Emirates",
            "sents_per_passage": 5,
            "retrieval_score": -1.633280634880066
        },
        {
            "text": "The National . Retrieved 21 January 2024 . ^ Foley, Sean (1999). \"THE UAE: POLITICAL ISSUES AND SECURITY DILEMMAS\".",
            "url": "https://en.wikipedia.org/wiki/Cabinet_of_the_United_Arab_Emirates",
            "sents_per_passage": 5,
            "retrieval_score": -2.459627628326416
        },
        {
            "text": "Heading level 2 (H2) : Includes names of grouped results, like \"Sports results\" and \"Videos.\" Heading level 3 (H3) : Includes individual search results titles, ad titles, and narrowed grouped results. On phones & tablets Heading level 1 (H1) : Includes the Google logo and a link named \"Google\" that points to the Google homepage. Heading level 2 (H2) : The first H2 heading is search results.",
            "url": "https://support.google.com/websearch/answer/181196?hl=en-AE",
            "sents_per_passage": 5,
            "retrieval_score": -11.163091659545898
        },
        {
            "text": "Enter your feedback and select Send . To select an accessibility link: With a keyboard : Press the Tab key until you reach the link you want. Press the Enter key. With a screen reader : Use the quick navigation controls. Navigate with section headings To help you navigate with a screen reader, the search results page has a hierarchy of section headings.",
            "url": "https://support.google.com/websearch/answer/181196?hl=en-AE",
            "sents_per_passage": 5,
            "retrieval_score": -11.229154586791992
        }
    ]
}